Revit 2024 API
BuiltInFailures.SketchFailures.TrussCrossingReferences Property
 Truss top and bottom references cannot cross.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TrussCrossingReferences { get; }
Visual Basic
Public Shared ReadOnly Property TrussCrossingReferences As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TrussCrossingReferences {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace